#Задача «Длина слова».
a="just to be clear, i wanna know what's goin on here"
#print(a)

print(len(a))