        # Задача 4 (сложно) "Всё, везде и сразу":
    # 4th programm
#print(13.42, 42.13)

    #задача, в которой необходимо вычленить из float числа A = A1.A2, B = B1.B2
    #провести логчическое или между A1 == B2 or A2 == B1

    #проверка логики fl&int
#print(13.42//1 == 13) #значение переводится в 1

    #отделить целочисленое
#print(int(13.42)) #A
#дает 13.0 float, необходимо целочесленый int, либо отделить 0 от числа, можно игнорировать его
#print(13.42//1) #A1
#print(42.13//1) #B1
    #найти дробь
#print(13.42*100%100) #A2
#print(42.13*100%100) #B2

#сама логика
print(13.42//1 == 42.13*100%100 or 13.42*100%100 == 42.13//1)